"Part1" = "ENGLISH";
"Part2" = "APPLE INC.";
"Part3" = "SHORTCUTS FOR iOS SOFTWARE LICENSE AGREEMENT";
"Part4" = "PLEASE READ THIS SOFTWARE LICENSE AGREEMENT (“LICENSE”) CAREFULLY BEFORE USING THE APPLE SOFTWARE. BY USING THE APPLE SOFTWARE, YOU ARE AGREEING TO BE BOUND BY THE TERMS OF THIS LICENSE. IF YOU DO NOT AGREE TO THE TERMS OF THIS LICENSE, DO NOT INSTALL AND/OR USE THE SOFTWARE.";
"Part5" = "IMPORTANT NOTE: To the extent that this software may be used to reproduce, modify, publish and distribute materials, it is licensed to you only for reproduction, modification, publication and distribution of non-copyrighted materials, materials in which you own the copyright, or materials you are authorized or legally permitted to reproduce, modify, publish or distribute. If you are uncertain about your right to copy, modify, publish or distribute any material, you should contact your legal advisor.";
"Part6" = "1. General.";
"Part7" = "A. The Apple software, and any third party software, documentation, interfaces, content, fonts and any data accompanying this License whether in read only memory, on any other media or in any other form (collectively the “Apple Software”) are licensed, not sold, to you by Apple Inc. (“Apple”) for use only under the terms of this License. Apple and/or Apple’s licensors retain ownership of the Apple Software itself and reserve all rights not expressly granted to you. ";
"Part8" = "B. Apple, at its discretion, may make available future upgrades or updates to the Apple Software for your compatible Apple-branded iOS device. The Apple Software upgrades and updates, if any, may not necessarily include all existing software features or new features that Apple releases for newer or other models of iOS devices. The terms of this License will govern any software upgrades or updates provided by Apple to the original Apple Software product, unless such upgrade or update is accompanied by a separate license in which case you agree that the terms of that license will govern such upgrade or update. ";
"Part9" = "2. Permitted License Uses and Restrictions.";
"Part10" = "A. License. Subject to the terms and conditions of this License and as permitted in the “Services and Content Usage Rules” set forth in the Apple Media Services Terms and Conditions (https://www.apple.com/legal/internet-services/itunes/) (“Usage Rules”), unless you obtained the Apple Software as described in Section 2B, you are granted a limited, non-transferable, non-exclusive license to install and use the Apple Software on any compatible Apple-branded iOS device that you own or control. You may not distribute or make the Apple Software available over a network where it could be used by multiple devices at the same time. You may not rent, lease, lend, sell, redistribute, or sublicense the Apple Software.";
"Part11" = "B. Volume or Maintenance License. If you obtained the Apple Software under a volume or maintenance license program with Apple, the terms of your volume or maintenance license will determine the number of copies of the Apple Software you are permitted to download, install, use and run on Apple-branded iOS devices you own or control.  Except as agreed to in writing by Apple, all other terms and conditions of this License shall apply to your use of the Apple Software obtained under a volume or maintenance license.";
"Part12" = "C. System Requirements. Apple Software is supported only on Apple-branded hardware that meets specified system requirements as indicated by Apple.";
"Part13" = "D. Content and Digital Materials. Title and intellectual property rights in and to any content, including trademarks, logos and images, displayed by or accessed through the Apple Software belong to the respective content owner. Such content may be protected by copyright, trademark or other intellectual property laws and treaties, and may be subject to terms of use of the third party providing such content. Except as otherwise provided in this License, (i) this License does not grant you any rights to use such content nor does it guarantee that such content will continue to be available to you and (ii) you may not use, extract or distribute, commercially or otherwise, on a standalone basis, any photographs, logos, text, code, images, graphics, artwork, audio, video or similar assets (“Digital Materials”) contained within, or provided as a part of, the Apple Software, or otherwise use the Digital Materials outside the context of its intended use as part of the Apple Software.";
"Part14" = "E. Use of Shortcuts. You acknowledge that all app and/or website action shortcuts (“Shortcuts”) are the sole responsibility of the party or parties from whom such Shortcuts originated. Apple has no control over, and assumes no responsibility for, the content or functionality of any third-party Shortcut. You use any Shortcut at your own risk and you are solely responsible for your compliance with any third-party terms or agreements arising from your use of any Shortcut. You acknowledge that Apple has no obligation to pre-screen Shortcuts, although Apple reserves the right in its sole discretion to pre-screen, refuse, disable or remove any Shortcuts. ";
"Part15" = "F.  Sharing Shortcuts. The Apple Software may allow you to share Shortcuts you create with others via a web link. Your shared Shortcut, along with any content embedded in it, will be stored on Apple servers for the purpose of enabling such sharing and may be used to generally improve Apple products and services. Your shared Shortcut, along with any content embedded in it, will be available to anyone who has access to the web link, who may then copy, save, modify and redistribute a copy of your Shortcut and all content embedded in it. By sharing a Shortcut, you represent that: (1) you have all necessary rights and licenses to such Shortcut and that it will not infringe or violate the rights of any other party; and (2) any Shortcut you share will not violate any laws, contribute to or encourage infringing or otherwise unlawful conduct, or otherwise be obscene or objectionable. You acknowledge that Apple has no obligation to review any Shortcuts you share, although Apple reserves the right in its sole discretion to review, disable or remove any Shortcuts you share.";
"Part16" = "G. Restrictions on Use. You agree not to: upload, post, e-mail, transmit, share or otherwise make available any Shortcut that: (1) is unlawful, tortious, defamatory, vulgar, obscene, libelous, or racially, ethnically or otherwise objectionable; (2) violates, or encourages any conduct that would violate, any applicable law or regulation or would give rise to civil liability; (3) promotes discrimination, bigotry, racism, hatred, harassment or harm against any individual or group; (4) is violent or threatening, or promotes violence or actions that are threatening to any other person; (5) promotes illegal or harmful activities; or (6) you know or believe to be false, misleading, fraudulent, or in any way deceptive to a user of such Shortcut. You further agree not to interfere with, disrupt, or create an undue burden on servers or networks connected to the Apple Software or any third party software applications, services or websites on your iOS device (“Third Party Apps”) or violate the regulations, policies or procedures of such networks or Third Party Apps.";
"Part17" = "H. Third Party Apps. In order to complete certain Shortcuts, the Apple Software may need to access certain Third Party Apps. You expressly consent to and authorize the Apple Software to access and use these Third Party Apps on your behalf to the extent necessary to complete the Shortcut with the Apple Software. To the extent that the Apple Software accesses any Third Party Apps, Apple has no express or implied obligation to provide any technical or other support for such Third Party Apps. Please contact the appropriate software vendor, manufacturer or service provider directly for technical support and customer service related to its software, service, website and/or products.  YOU FURTHER AGREE YOU SHALL BE BOUND BY, AND AGREE TO COMPLY WITH, ALL APPLICABLE TERMS OF SERVICE OR OTHER AGREEMENTS FOR SUCH THIRD PARTY APPS WHEN USING THE APPLE SOFTWARE. YOU ARE SOLELY RESPONSIBLE FOR ENSURING THAT ALL SHORTCUTS COMPLY WITH THE APPLICABLE TERMS FOR EACH THIRD PARTY APP USED BY THE SHORTCUT. APPLE DOES NOT GUARANTEE IN ANY WAY THAT SHORTCUTS COMPLY WITH THE TERMS FOR ANY THIRD PARTY APPS AND APPLE IS NOT RESPONSIBLE FOR ANY THIRD PARTY SHORTCUTS.";
"Part18" = "I.  No Reverse Engineering. You may not, and you agree not to or enable others to, copy (except as expressly permitted by this License or by the Usage Rules if they are applicable to you), decompile, reverse engineer, disassemble, attempt to derive the source code of, decrypt, modify, or create derivative works of the Apple Software or any services provided by the Apple Software, or any part thereof (except as and only to the extent any foregoing restriction is prohibited by applicable law or to the extent as may be permitted by the licensing terms governing use of open-sourced components included with the Apple Software).";
"Part19" = "J.  Compliance with Laws. You agree to use the Apple Software and the Services (as defined in Section 4 below) in compliance with all applicable laws, including local laws of the country or region in which you reside or in which you download or use the Apple Software and Services.";
"Part20" = "K. Automatic Updates.  If you choose to allow automatic app updates, your device will periodically check with Apple for updates and upgrades to the Apple Software and, if an update or upgrade is available, the update or upgrade will automatically download and install onto your device and, if applicable, your peripheral devices.  You can turn off the automatic app updates altogether at any time by changing the automatic app updates settings found within Settings.";
"Part21" = "3. Consent to Use of Data. ";
"Part22" = "A. Analytics Data. If you opt in to Analytics collection, you agree that Apple and its subsidiaries and agents may collect, maintain, process and use diagnostic, technical, usage and related information, including but not limited to unique system or hardware identifiers, information about your iOS device, computer, system and application software, and peripherals, that is gathered periodically to provide and improve Apple’s products and services, facilitate the provision of software updates, product support and other services to you (if any) related to the Apple Software, and to verify compliance with the terms of this License. Apple may use this information, as long as it is collected in a form that does not personally identify you, for the purposes described above. To enable Apple’s partners and third party developers to improve their software, hardware and services designed for use with Apple products, Apple may also provide any such partner or third party developer with a subset of diagnostic information that is relevant to that partner’s or developer’s software, hardware and/or services, as long as the diagnostic information is in a form that does not personally identify you. ";
"Part23" = "B. Location Data. Apple and its partners, licensees and third party developers may provide certain services through the Apple Software that rely upon location information. To provide and improve these services, where available, Apple and its partners, licensees and third party developers may transmit, collect, maintain, process and use your location data. The location data and queries collected by Apple are collected in a form that does not personally identify you and may be used by Apple and its partners, licensees and third party developers to provide and improve location-based products and services. By using any location-based services provided by or through the Apple Software, you agree and consent to Apple’s and its partners’, licensees’ and third party developers’ transmission, collection, maintenance, processing and use of your location data and queries to provide and improve such products and services. You may withdraw this consent at any time by going to the Location Services setting on your iOS device and either turning off the global Location Services setting or turning off the individual location setting for the Apple Software. When using third party applications or services on the iOS device that use or provide location data, you are subject to and should review such third party’s terms and privacy policy on use of location data by such third party applications or services.";
"Part24" = "C. Privacy Policy. At all times your information will be treated in accordance with Apple’s Privacy Policy, which can be viewed at: https://www.apple.com/legal/privacy/.";
"Part25" = "4. Services and Third Party Materials.";
"Part26" = "A. General.  The Apple Software may enable access to Apple’s iTunes Store, App Store, iCloud, Maps and other Apple and third party services and web sites (collectively and individually, “Services”). Such Services may not be available in all languages or in all countries.  Use of these Services requires Internet access and use of certain Services may require an Apple ID, may require you to accept additional terms and may be subject to additional fees. By using this software in connection with an iTunes Store account, Apple ID or other Apple Service, you agree to the applicable terms of service for that Service, such as the latest Apple Media Services Terms and Conditions which you may access and review at https://www.apple.com/legal/internet-services/itunes/.";
"Part27" = "B. If you choose to use the iCloud services through the Apple Software, such use is subject to the following additional terms: iCloud Terms and Conditions available at https://www.apple.com/legal/internet-services/icloud/ and Apple’s Privacy Policy available at https://www.apple.com/legal/privacy/.";
"Part28" = "C. You understand that by using any of the Services, you may encounter content that may be deemed offensive, indecent, or objectionable, which content may or may not be identified as having explicit language. Nevertheless, you agree to use the Services at your sole risk and that Apple shall have no liability to you for content that may be found to be offensive, indecent, or objectionable. ";
"Part29" = "D. Certain Services may display, include or make available services, content, data, information, applications or materials from third parties (“Third Party Materials”) or provide links to certain third party web sites or applications. By using the Services, you acknowledge and agree that Apple is not responsible for examining or evaluating the content, accuracy, completeness, timeliness, validity, copyright compliance, legality, decency, quality or any other aspect of such Third Party Materials, applications or web sites. Apple, its officers, affiliates and subsidiaries do not warrant or endorse and do not assume and will not have any liability or responsibility to you or any other person for any third-party Services, Third Party Materials, applications or web sites, or for any other materials, products, or services of third parties. Third Party Materials and links to other web sites or applications are provided solely as a convenience to you. ";
"Part30" = "E. To the extent that you upload any content through the use of the Services, you represent that you own all rights in, or have authorization or are otherwise legally permitted to upload, such content and that such content does not violate any terms of service applicable to the Services. You agree that the Services contain proprietary content, information and material, including but not limited to any Digital Materials, that is owned by Apple, the site owner and/or their licensors, and is protected by applicable intellectual property and other laws, including but not limited to copyright.  You agree that you will not use such proprietary content, information or materials other than for permitted use of the Services or in any manner that is inconsistent with the terms of this License or that infringes any intellectual property rights of a third party or Apple. No portion of the Services may be reproduced in any form or by any means. You agree not to modify, rent, lease, loan, sell, distribute, or create derivative works based on the Services, in any manner, and you shall not exploit the Services in any unauthorized way whatsoever, including but not limited to, using the Services to transmit any computer viruses, worms, trojan horses or other malware, or by trespass or burdening network capacity. You further agree not to use the Services in any manner to harass, abuse, stalk, threaten, defame or otherwise infringe or violate the rights of any other party, and that Apple is not in any way responsible for any such use by you, nor for any harassing, threatening, defamatory, offensive, infringing or illegal messages or transmissions that you may receive as a result of using any of the Services.";
"Part31" = "F. In addition, Services and Third Party Materials that may be accessed, linked to or displayed through the Apple Software are not available in all languages or in all countries or regions. Apple makes no representation that such Services and Third Party Materials are appropriate or available for use in any particular location. To the extent you choose to use or access such Services and Third Party Materials, you do so at your own initiative and are responsible for compliance with any applicable laws, including but not limited to applicable local laws and privacy and data collection laws. Apple and its licensors reserve the right to change, suspend, remove, or disable access to any Services at any time without notice. In no event will Apple be liable for the removal of or disabling of access to any such Services. Apple may also impose limits on the use of or access to certain Services, in any case and without notice or liability. ";
"Part32" = "5. Termination. This License is effective until terminated. Your rights under this License will terminate automatically or otherwise cease to be effective without notice from Apple if you fail to comply with any term(s) of this License. Upon the termination of this License, you shall cease all use of the Apple Software and destroy all copies, full or partial, of the Apple Software. Sections 2I, 3, 4, 5, 6, 7, 8, 10 and 11 of this License shall survive any such termination.";
"Part33" = "6. Disclaimer of Warranties. ";
"Part34" = "A. If you are a customer who is a consumer (someone who uses the Apple Software outside of your trade, business or profession), you may have legal rights in your country of residence which would prohibit the following limitations from applying to you, and where prohibited they will not apply to you. To find out more about consumer rights, you should contact a local consumer advice organization.";
"Part35" = "B. YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT, TO THE EXTENT PERMITTED BY APPLICABLE LAW, USE OF THE APPLE SOFTWARE AND ANY SERVICES PERFORMED BY OR ACCESSED THROUGH THE APPLE SOFTWARE IS AT YOUR SOLE RISK AND THAT THE ENTIRE RISK AS TO SATISFACTORY QUALITY, PERFORMANCE, ACCURACY AND EFFORT IS WITH YOU. ";
"Part36" = "C. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE APPLE SOFTWARE AND SERVICES ARE PROVIDED “AS IS” AND “AS AVAILABLE”, WITH ALL FAULTS AND WITHOUT WARRANTY OF ANY KIND, AND APPLE AND APPLE’S LICENSORS (COLLECTIVELY REFERRED TO AS “APPLE” FOR THE PURPOSES OF SECTIONS 6 AND 7) HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH RESPECT TO THE APPLE SOFTWARE AND SERVICES, EITHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES AND/OR CONDITIONS OF MERCHANTABILITY, SATISFACTORY QUALITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY, QUIET ENJOYMENT, AND NON-INFRINGEMENT OF THIRD PARTY RIGHTS. ";
"Part37" = "D. APPLE DOES NOT WARRANT AGAINST INTERFERENCE WITH YOUR ENJOYMENT OF THE APPLE SOFTWARE AND SERVICES, THAT THE FUNCTIONS CONTAINED IN, OR SERVICES PERFORMED OR PROVIDED BY, THE APPLE SOFTWARE WILL MEET YOUR REQUIREMENTS, THAT THE OPERATION OF THE APPLE SOFTWARE OR SERVICES WILL BE UNINTERRUPTED OR ERROR-FREE, THAT ANY SERVICES WILL CONTINUE TO BE MADE AVAILABLE, THAT THE APPLE SOFTWARE OR SERVICES WILL BE CORRECTED, OR THAT THE APPLE SOFTWARE WILL BE COMPATIBLE OR WORK WITH ANY THIRD PARTY SOFTWARE, APPLICATIONS OR THIRD PARTY SERVICES. INSTALLATION OF THIS APPLE SOFTWARE MAY AFFECT THE AVAILABILITY AND USABILITY OF THIRD PARTY SOFTWARE, APPLICATIONS OR THIRD PARTY SERVICES, AS WELL AS APPLE PRODUCTS AND SERVICES. ";
"Part38" = "E. YOU FURTHER ACKNOWLEDGE THAT THE APPLE SOFTWARE AND SERVICES ARE NOT INTENDED OR SUITABLE FOR USE IN SITUATIONS OR ENVIRONMENTS WHERE THE FAILURE OR TIME DELAYS OF, OR ERRORS OR INACCURACIES IN THE CONTENT, DATA OR INFORMATION PROVIDED BY, THE APPLE SOFTWARE OR SERVICES COULD LEAD TO DEATH, PERSONAL INJURY, OR SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE, INCLUDING WITHOUT LIMITATION THE OPERATION OF NUCLEAR FACILITIES, AIRCRAFT NAVIGATION OR COMMUNICATION SYSTEMS, AIR TRAFFIC CONTROL, LIFE SUPPORT OR WEAPONS SYSTEMS.";
"Part39" = "F. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY APPLE OR AN APPLE AUTHORIZED REPRESENTATIVE SHALL CREATE A WARRANTY. SHOULD THE APPLE SOFTWARE OR SERVICES PROVE DEFECTIVE, YOU ASSUME THE ENTIRE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES OR LIMITATIONS ON APPLICABLE STATUTORY RIGHTS OF A CONSUMER, SO THE ABOVE EXCLUSION AND LIMITATIONS MAY NOT APPLY TO YOU. ";
"Part40" = "7. Limitation of Liability. TO THE EXTENT NOT PROHIBITED BY APPLICABLE LAW, IN NO EVENT SHALL APPLE BE LIABLE FOR PERSONAL INJURY, OR ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES WHATSOEVER, INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, CORRUPTION OR LOSS OF DATA, FAILURE TO TRANSMIT OR RECEIVE ANY DATA, BUSINESS INTERRUPTION OR ANY OTHER COMMERCIAL DAMAGES OR LOSSES, ARISING OUT OF OR RELATED TO YOUR USE OR INABILITY TO USE THE APPLE SOFTWARE AND SERVICES OR ANY THIRD PARTY SOFTWARE OR APPLICATIONS IN CONJUNCTION WITH THE APPLE SOFTWARE, HOWEVER CAUSED, REGARDLESS OF THE THEORY OF LIABILITY (CONTRACT, TORT OR OTHERWISE) AND EVEN IF APPLE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR PERSONAL INJURY, OR OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS LIMITATION MAY NOT APPLY TO YOU. In no event shall Apple’s total liability to you for all damages (other than as may be required by applicable law in cases involving personal injury) exceed the amount of fifty dollars ($50.00). The foregoing limitations will apply even if the above stated remedy fails of its essential purpose.";
"Part41" = "8. Export Control. You may not use or otherwise export or re-export the Apple Software except as authorized by United States law and the laws of the jurisdiction(s) in which the Apple Software was obtained. In particular, but without limitation, the Apple Software may not be exported or re-exported (a) into any U.S. embargoed countries or (b) to anyone on the U.S. Treasury Department’s list of Specially Designated Nationals or the U.S. Department of Commerce Denied Person’s List or Entity List or any other restricted party lists. By using the Apple Software, you represent and warrant that you are not located in any such country or on any such list. You also agree that you will not use the Apple Software for any purposes prohibited by United States law, including, without limitation, the development, design, manufacture or production of missiles, nuclear, chemical or biological weapons. ";
"Part42" = "9. Government End Users. The Apple Software and related documentation are “Commercial Items”, as that term is defined at 48 C.F.R. §2.101, consisting of “Commercial Computer Software” and “Commercial Computer Software Documentation”, as such terms are used in 48 C.F.R. §12.212 or 48 C.F.R. §227.7202, as applicable. Consistent with 48 C.F.R. §12.212 or 48 C.F.R. §227.7202-1 through 227.7202-4, as applicable, the Commercial Computer Software and Commercial Computer Software Documentation are being licensed to U.S. Government end users (a) only as Commercial Items and (b) with only those rights as are granted to all other end users pursuant to the terms and conditions herein. Unpublished-rights reserved under the copyright laws of the United States.";
"Part43" = "10. Controlling Law and Severability. This License will be governed by and construed in accordance with the laws of the State of California, excluding its conflict of law principles. This License shall not be governed by the United Nations Convention on Contracts for the International Sale of Goods, the application of which is expressly excluded. If you are a consumer based in the United Kingdom, this License will be governed by the laws of the jurisdiction of your residence. If for any reason a court of competent jurisdiction finds any provision, or portion thereof, to be unenforceable, the remainder of this License shall continue in full force and effect.";
"Part44" = "11. Complete Agreement; Governing Language. This License constitutes the entire agreement between you and Apple relating to the Apple Software, and supersedes all prior or contemporaneous understandings regarding such subject matter. No amendment to or modification of this License will be binding unless in writing and signed by Apple. Any translation of this License is done for local requirements and in the event of a dispute between the English and any non-English versions, the English version of this License shall govern, to the extent not prohibited by local law in your jurisdiction.";
"Part45" = "12. Third Party Acknowledgements. Portions of the Apple Software may utilize or include third party software and other copyrighted material. Acknowledgements, licensing terms and disclaimers for such material are contained in the electronic documentation for the Apple Software, and your use of such material is governed by their respective terms.";
"Part46" = "EA1576";
"Part47" = "8/16/2018";